; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v8 - type_1 ?v1 - type_3)
 	      (pred_4 ?v3 - object ?v1 - type_3)
	      (pred_3 ?v8 - type_1 ?v2 - type_2)
	      (pred_2 ?v8 - type_1 ?v3 - object ?v2 - type_2))

   (:action op_3
       :parameters  (?v8 - type_1 ?v4 ?v5 - type_3)
       :precondition (and  (pred_1 ?v8 ?v4))
       :effect (and  (pred_1 ?v8 ?v5)
		     (not (pred_1 ?v8 ?v4))))

   (:action op_1
       :parameters (?v8 - type_1 ?v6 - object ?v7 - type_3 ?v2 - type_2)
       :precondition  (and  (pred_4 ?v6 ?v7) (pred_1 ?v8 ?v7) (pred_3 ?v8 ?v2))
       :effect (and (pred_2 ?v8 ?v6 ?v2)
		    (not (pred_4 ?v6 ?v7)) 
		    (not (pred_3 ?v8 ?v2))))

   (:action op_2
       :parameters (?v8 - type_1 ?v6 - object ?v7 - type_3 ?v2 - type_2)
       :precondition  (and  (pred_2 ?v8 ?v6 ?v2) (pred_1 ?v8 ?v7))
       :effect (and (pred_4 ?v6 ?v7)
		    (pred_3 ?v8 ?v2)
		    (not (pred_2 ?v8 ?v6 ?v2)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_02 - type_1
obj_06 obj_09 - type_2
obj_01 obj_08 obj_03 - type_3
obj_05 obj_04 obj_07 - object)
(:init
(pred_1 obj_02 obj_08)
(pred_3 obj_02 obj_06)
(pred_3 obj_02 obj_09)
(pred_4 obj_05 obj_01)
(pred_4 obj_04 obj_01)
(pred_4 obj_07 obj_01)
)
(:goal
(and
(pred_4 obj_05 obj_08)
(pred_4 obj_04 obj_01)
(pred_4 obj_07 obj_03)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_02 ?b obj_09))))
)
)

; plan
1. (op_3 obj_02 obj_08 obj_01)
   deleted: (pred_1 obj_02 obj_08)
   added: (pred_1 obj_02 obj_01)
   goals met: 1 of 3
2. (op_1 obj_02 obj_05 obj_01 obj_06)
   deleted: (pred_4 obj_05 obj_01) (pred_3 obj_02 obj_06)
   added: (pred_2 obj_02 obj_05 obj_06)
   goals met: 1 of 3
3. (op_3 obj_02 obj_01 obj_08)
   deleted: (pred_1 obj_02 obj_01)
   added: (pred_1 obj_02 obj_08)
   goals met: 1 of 3
4. (op_2 obj_02 obj_05 obj_08 obj_06)
   deleted: (pred_2 obj_02 obj_05 obj_06)
   added: (pred_4 obj_05 obj_08) (pred_3 obj_02 obj_06)
   goals met: 2 of 3
5. (op_3 obj_02 obj_08 obj_01)
   deleted: (pred_1 obj_02 obj_08)
   added: (pred_1 obj_02 obj_01)
   goals met: 2 of 3
6. (op_1 obj_02 obj_07 obj_01 obj_06)
   deleted: (pred_4 obj_07 obj_01) (pred_3 obj_02 obj_06)
   added: (pred_2 obj_02 obj_07 obj_06)
   goals met: 2 of 3
7. (op_3 obj_02 obj_01 obj_03)
   deleted: (pred_1 obj_02 obj_01)
   added: (pred_1 obj_02 obj_03)
   goals met: 2 of 3
8. (op_2 obj_02 obj_07 obj_03 obj_06)
   deleted: (pred_2 obj_02 obj_07 obj_06)
   added: (pred_4 obj_07 obj_03) (pred_3 obj_02 obj_06)
   goals met: 3 of 3
